{
  "lessons": [
    {
      "slug": "1021",
      "introduction": [
        "At the end of this lesson, you will know how to write blockchain queries using cardano-cli. The Cardano Command Line Interface, or cardano-cli, is included when you install Cardano Node.",
        "Cardano Node is the software that runs the Cardano blockchain on a computer.",
        "We will practice writing queries with cardano-cli throughout Module 102. You will see that simple queries take only a moment to execute.",
        "Setting up a Cardano Node so that you can make queries can be a bit trickier. In this lesson, we will explore two ways of accessing the Cardano Preprod network."
      ],
      "links": [
        { "url": "https://docs.cardano.org/learn/cardano-node", "linkText": "Official Docs: Cardano Node" },
        { "url": "https://github.com/input-output-hk/cardano-node", "linkText": "Cardano Node on IOHK GitHub" },
        { "url": "https://github.com/input-output-hk/cardano-node/blob/master/doc/reference/cardano-node-cli-reference.md", "linkText": "cardano-cli reference" },
        { "url": "https://book.world.dev.cardano.org/environments.html", "linkText": "Cardano Network Configuration Files" }
      ],
      "videoHeading": "",
      "youtubeId": "",
      "successComponent": false,
      "success": {
        "criteria": "",
        "text": ""
      },
      "assignmentComponent": true,
      "markdownComponent": false
    },
    {
      "slug": "1022",
      "introduction": [
        "Cardano CLI can do more than just query the blockchain. It can also be used to build a transaction, register a stake pool, or create a new Cardano address.",
        "In this lesson, you will see how to create a new \"wallet\" using cardano-cli.",
        "You will also see that building a contract address is similar to building a wallet address."
      ],
      "links": [
      ],
      "videoHeading": "",
      "youtubeId": "",
      "successComponent": false,
      "success": {
        "criteria": "",
        "text": ""
      },
      "assignmentComponent": true,
      "markdownComponent": false
    },
    {
      "slug": "1023",
      "introduction": [
        "We can use cardano-cli to build transactions that send tokens from one address to another.",
        "In this lesson you will start to learn what is happening \"behind the scenes\" when sending tADA in a user-friendly browser wallet.",
        "To talk about about transactions on Cardano, you must also talk about UTxOs.",
        "A UTxO is an \"Unspent Transaction Output\". This feels like a mouthful at first, but it actually means exactly what it says. Take a moment to think about it word by word: you're probably getting the right idea."
      ],
      "links": [
      ],
      "videoHeading": "",
      "youtubeId": "",
      "successComponent": false,
      "success": {
        "criteria": "",
        "text": ""
      },
      "assignmentComponent": true,
      "markdownComponent": false
    },
    {
      "slug": "1024",
      "introduction": [
        "Locking tokens in a contract address is very similar to sending a transaction to any wallet address, with one key difference: When sending a transaction to a contract address, we must include \"datum\" in the tx-out.",
        "In this introduction to smart contract transactions, we will lock some tokens at an Always Succeeds contract address."
      ],
      "links": [
      ],
      "videoHeading": "",
      "youtubeId": "",
      "successComponent": false,
      "success": {
        "criteria": "",
        "text": ""
      },
      "assignmentComponent": true,
      "markdownComponent": false
    },
    {
      "slug": "1025",
      "introduction": [
        "Unlocking tokens is more complicated than locking tokens.",
        "In an unlocking transaction, we must follow the rules defined by a Plutus validator. We must also provide the necessary Plutus script, datum, and redeemer within the unlocking transaction.",
        "In this lesson you will unlock the UTxO that you locked in Lesson 102.4. You might also unlock a UTxO locked by someone else - this is \"Always Succeeds\", after all!",
        "Throughout this course, you will see different scenarios for unlocking UTxOs from Contract Addresses. The purpose of this example is to give you a place to start."
      ],
      "links": [
      ],
      "videoHeading": "",
      "youtubeId": "",
      "successComponent": false,
      "success": {
        "criteria": "",
        "text": ""
      },
      "assignmentComponent": true,
      "markdownComponent": false
    },
    {
      "slug": "1026",
      "introduction": [
        "Bash scripts, also known as Shell scripts, can make it very efficient to work on the command line.",
        "Scripts are used to automate processes, and can be used on remote servers to perform frequent actions.",
        "In this course, we will scripts as a form of documentation. Take a look at the provided scripts and see how well you can read them."
      ],
      "links": [
        { "url": "https://gitlab.com/gimbalabs/ppbl-2023/ppbl2023-plutus-template/-/tree/main/bash-scripts", "linkText": "View bash-scripts in PPBL2023 Plutus Template" },
        { "url": "https://www.shellscript.sh/", "linkText": "Shell Scripting Tutorial" }
      ],
      "videoHeading": "",
      "youtubeId": "",
      "successComponent": false,
      "success": {
        "criteria": "",
        "text": ""
      },
      "assignmentComponent": true,
      "markdownComponent": false
    }
  ]
}
