{
  "lessons": [
    {
      "slug": "1011",
      "introduction": [
        "In this course, you will learn how to write smart contracts that can be used on the Cardano blockchain. In this module, we will take our first look at some of the smart contract languages on Cardano.",
        "All of these languages have some things in common.",
        "All of these languages share some basic design patterns, even though each language looks a little different.",
        "All of these langauges compile to Untyped Plutus Core, which is the language is actually used on the Cardano blockchain.",
        "To see what UPLC looks like, watch this video."
      ],
      "links": [],
      "videoHeading": "What does it mean to \"compile a Plutus script\"?",
      "youtubeId": "",
      "successComponent": false,
      "success": {
        "criteria": "you can compile a contract to UPLC from the language of your choice.",
        "text": "To master this learning target, you must attempt at least one of the approaches suggested in Lessons 101.3 through 101.6. Are you ready? If so, move on to Lesson 2."
      },
      "assignmentComponent": true,
      "markdownComponent": false
    },
    {
      "slug": "1012",
      "introduction": [
        "Once you compile a smart contract to UPLC, what can you do with it?",
        "This is question we will cover in depth in Modules 102 and 201.",
        "In Module 102 we will start to build transactions using compiled Plutus scripts.",
        "In Module 201, we will start to use our Plutus scripts in a javascript-based front-end.",
        "Watch this video to start learning more about the role of UPLC in a decentralized application."
      ],
      "links": [],
      "videoHeading": "",
      "youtubeId": "",
      "successComponent": false,
      "success": {
        "criteria": "you can explain how Plutus scripts are used in a Cardano application.",
        "text": "At the end of this module, you will have your first compiled Plutus scripts. In Modules 102 and 201 you will start to learn how to use them. Later in this course, we will ask you about this learning target again."
      },
      "assignmentComponent": true,
      "markdownComponent": true
    },
    {
      "slug": "1013",
      "introduction": [
        "Demeter.run is a cloud-based Cardano development platform built by TxPipe.",
        "Demeter is a very helpful tool for anyone who wants to get started quickly with Cardano development. Many developers start with Demeter to get an initial feel for how Cardano works.",
        "To see how to get started, watch this video."
      ],
      "links": [
        { "url": "https://demeter.run/", "linkText": "demeter.run" },
        { "url": "https://txpipe.io/", "linkText": "TxPipe" },
        {
          "url": "https://iog-academy.gitbook.io/plutus-pioneers-program-fourth-cohort/lectures/lecture-01/lesson-01",
          "linkText": "Demeter.run is introduced in Plutus Pioneers"
        },
        {
          "url": "https://github.com/txpipe/plutus-starter-kit",
          "linkText": "For this lesson, we will use the Plutus Hello World project from TxPipe"
        }
      ],
      "videoHeading": "Getting Started with Demeter.run",
      "youtubeId": "",
      "successComponent": false,
      "success": {
        "criteria": "you can see a file called always-succeeds.plutus in your Demeter development environment.",
        "text": "To complete this lesson, follow the documentation below."
      },
      "assignmentComponent": true,
      "markdownComponent": true
    },
    {
      "slug": "1014",
      "introduction": [
        "Experienced Plutus developers will tell you that setting up a local environment for writing PlutusTX is one of the hardest parts about learning Plutus.",
        "This is one of the reasons that developers are so excited about new languages like Aiken and plu-ts, which we will investigate in Lessons 101.5 and 101.6.",
        "Still, we want you to have the option of building with PlutusTx on your own computer.",
        "Follow along with this video, or join us at Plutus PBL Live coding on 2023-03-23 to see a live demonstration and to ask questions."
      ],
      "links": [
        { "url": "https://nixos.org/", "linkText": "Nix: official site" },
        { "url": "https://nixos.org/", "linkText": "Plutus Apps repository on GitHub" },
        { "url": "https://nixos.org/", "linkText": "Gimbalabs Starter template on GitLab" }
      ],
      "videoHeading": "Setting up your own Plutus development environment",
      "youtubeId": "",
      "successComponent": false,
      "success": {
        "criteria": "you can compile a .plutus file from PlutusTx on your computer.",
        "text": "Review the video above, or follow along with the documentation below. If you get stuck, please ask questions - you are now part of a community where a lot of people know what it's like to struggle with this step!"
      },
      "assignmentComponent": true,
      "markdownComponent": true
    },
    {
      "slug": "1015",
      "introduction": [
        "Aiken is a new language for developing smart contracts on Cardano. If you have a background in Rust development, you might find yourself at home with Aiken.",
        "The Aiken language was written in Rust, but Aiken is not Rust. When we use Aiken, we will use some Rust tooling.",
        "To get started, watch this video or follow along with the documentation below."
      ],
      "links": [
        { "linkText": "Aiken Programming Language", "url": "https://aiken-lang.org/" },
        {
          "linkText": "The Aiken documentation is helpful. We recommend taking a look!",
          "url": "https://aiken-lang.org/getting-started"
        }
      ],
      "videoHeading": "Getting started with Aiken",
      "youtubeId": "",
      "successComponent": false,
      "assignmentComponent": true,
      "markdownComponent": true
    },
    {
      "slug": "1016",
      "introduction": [
        "plu-ts is a new language for developing smart contracts on Cardano. If you have a background in Javascript or Typescript development, you might find yourself at home with plu-ts.",
        "plu-ts is written in Typescript and can be embedded in any existing Javascript or Typescript project.",
        "To get started, watch this video or follow along with the documentation below."
      ],
      "links": [{ "url": "https://pluts.harmoniclabs.tech/", "linkText": "plu-ts official site" }],
      "videoHeading": "Getting started with plu-ts",
      "youtubeId": "",
      "successComponent": false,
      "assignmentComponent": true,
      "markdownComponent": true
    }
  ]
}
